package by.academy.deal;

public class Main {
	
	 public static void main(String[] args) {
		
	User seller = new User("Bob", 200);
	User buyer = new User("Nick", 100);	
	
	// создать продукты
	Product bread = new Product("Bread", 10, 2, 1 );
	Product milk = new Product("Milk", 8, 1, 1 );
	Product apples = new Product("Apples", 7, 3, 1 );
	
	public printBill() {
//		seller.name = "Bob";
//		seller.money = 100; 
	
	}
		
//	1. Необходимо реализовать программу, которая будет позволять вводить сделки купли-продажи товаров между двумя участниками.
//	В каждой сделке может быть несколько товаров, сумма сделки рассчитывается из суммы всех товаров. 
//	Сумма каждого товара рассчитывается из его стоимости и количества.
//	Программа должна позволить ввести информацию о сделках, сохранить ее в памяти и вывести на экран.
//	Ввод информацию осуществляется с экрана (консоли). 
//	Количество дополнительной информацию о сделке, участнике, товаре придумать самому (больше одного поля для класса). 
//	Сделка должна содержать массив продуктов
	
	}
}
